In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn

In [2]:
ser= Series(np.random.randn(6), index= [[1, 1, 1, 2, 2, 2], ['a', 'b', 'c', 'a', 'b', 'c']])

In [3]:
ser

1  a   -0.997197
   b    0.303738
   c    1.057231
2  a   -0.534552
   b    0.577919
   c    0.646962
dtype: float64

In [4]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [7]:
ser[2]

a   -0.534552
b    0.577919
c    0.646962
dtype: float64

In [8]:
ser

1  a   -0.997197
   b    0.303738
   c    1.057231
2  a   -0.534552
   b    0.577919
   c    0.646962
dtype: float64

In [9]:
ser[:, 'a']

1   -0.997197
2   -0.534552
dtype: float64

In [10]:
dframe= ser.unstack()

In [11]:
dframe

          a         b         c
1 -0.997197  0.303738  1.057231
2 -0.534552  0.577919  0.646962

In [12]:
dframe.T.unstack()

1  a   -0.997197
   b    0.303738
   c    1.057231
2  a   -0.534552
   b    0.577919
   c    0.646962
dtype: float64

In [14]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [15]:
dframe2.index.names= ['INDEX_1', 'INDEX_2']
dframe2.columns.names= ['Cities', 'Temp']
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [16]:
dframe2.swaplevel('Cities','Temp', axis= 1 )

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [19]:
dframe2.sort_index(1)

Cities           LA   NY       SF
Temp            hot cold hot cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       1        10    8   9   11
        2        14   12  13   15

In [20]:
dframe2.sort_index(1).sort_index(0)

Cities           LA   NY       SF
Temp            hot cold hot cold
INDEX_1 INDEX_2
a       1         2    0   1    3
        2         6    4   5    7
b       1        10    8   9   11
        2        14   12  13   15

In [21]:
dframe2.sum(level='Temp',axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27